############################################################################################################
#         简单 pair trading 的回测
############################################################################################################
# 注意到的问题：
#   1. 涨跌停板不可以购买。
#   2. 停牌是不可以购买。
#   3. 简单的复权处理（复权因子）
# 没有注意到的问题：
#   1. 复权具体事项：
#     1.1. 送红股派息时候的税率处理
#     1.2. 股票的持仓时间分化处理（涉及到股息的税率处理）
#     1.3. 配股时候的金钱处理
#     1.4. balance和position具体变动更加细化
#     1.5. 待添加
#   2. close购买的滑点问题
#   3. 其他待添加
############################################################################################################
setwd("/home/zhuzhi/r_idea/")
source("./stock_tools.R")

############################################################################################################
#         第一步：读入数据并预处理
############################################################################################################
#   以两只股票为例子，写一个粗糙的代码
#   sh601288 农业银行
#   sh601398 工商银行
############################################################################################################

#  读入数据
sh601288_fuquan <- read_stock_fuquan("./data/fuquan/601288")
sh601288_market <- read_stock("./data/market/601288")
sh601288 <- merge_stock(sh601288_market, sh601288_fuquan)
rm(sh601288_market,sh601288_fuquan)

sh601398_fuquan <- read_stock_fuquan("./data/fuquan/601398")
sh601398_market <- read_stock("./data/market/601398")
sh601398 <- merge_stock(sh601398_market, sh601398_fuquan)
rm(sh601398_market, sh601398_fuquan)

# 预处理
sh601398 <- pre_close_add(sh601398)
sh601398 <- ohlc_limit_classify(sh601398)

sh601288 <- pre_close_add(sh601288)
sh601288 <- ohlc_limit_classify(sh601288)


############################################################################################################
#         第二步：设置参数
############################################################################################################
# stock_main: stock_main := sh601288
# stock_sub: stock_sub := sh601398
#
# 价差定义: price_ratio := log(stock_main) - log(stock_sub)
# 仓位定义: position := (position_of_stock_main - position_of_stock_sub)/2
# 多头建仓信号: price_ratio >= 2 & position = 0
# 多头平仓信号: price_ratio <= 1 & position > 0
# 空头建仓信号: price_ratio <= -2 & position = 0
# 空头平仓信号: price_ratio >= -1 & position < 0
# 辅助购买指标: ohlc_limit_type
############################################################################################################


